/* ---------------------------------------------------------------------------- */
// New in 1.0

/* general use */
"OK" = "OK";
"Yes" = "Yes";
"No" = "No";
"Don't show again" = "Don't show again";

/* misk */
"Set as default compressor" = "Set as default compressor";
"Not now" = "Not now";
"Want to make Keka your default compressor?" = "Want to make Keka your default compressor?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences.";
"Really want to close Keka?" = "Really want to close Keka?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done.";

/* ---------------------------------------------------------------------------- */



/* Growl */

/* ---------------------------------------------------------------------------- */
// New in 1.0
"Password needed" = "Password needed";
"File \"%@\" needs a password to be extracted" = "File \"%@\" needs a password to be extracted";
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Extraction of \"%@\" done" = "Extraction of \"%@\" done";
"Extraction of \"%@\" failed." = "Extraction of \"%@\" failed.";
//"Extraction of file \"%@\" complete" = "Extraction of file \"%@\" complete";
//"Extraction of file \"%@\" failed." = "Extraction of file \"%@\" failed.";
/* ---------------------------------------------------------------------------- */
"Extraction complete" = "Extraction complete";
"Extraction fail" = "Extraction fail";
"Compression complete" = "Compression complete";
"File \"%@\" created" = "File \"%@\" created";
"Compression fail" = "Compression fail";
"File \"%@\" cannot be created" = "File \"%@\" cannot be created";
"Operation not implemented" = "Operation not implemented";
"This operation is not implemented yet so Keka is in beta process." = "This operation is not implemented yet so Keka is in beta process.";



/* Progress window */
"Performing operation..." = "Performing operation...";
"Waiting..." = "Waiting...";
"Extracting \"%@\"" = "Extracting \"%@\"";
"Extracting \"%@...\"" = "Extracting \"%@...\"";
"Creating %@ file..." = "Creating %@ file...";
"Creating file \"%@\"" = "Creating file \"%@\"";
"Creating file \"%@...\"" = "Creating file \"%@...\"";
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Time elapsed: %d:%@%d:%@%d hours%@" = "Time elapsed: %d:%@%d:%@%d hours%@";
"Time elapsed: %d:%@%d minutes%@" = "Time elapsed: %d:%@%d minutes%@";
"Time elapsed: %d seconds%@" = "Time elapsed: %d seconds%@";


//"Time elapsed: %d seconds" = "Time elapsed: %d seconds";
//"Time elapsed: %d:%@%d minutes" = "Time elapsed: %d:%@%d minutes";
//"Time elapsed: %d:%@%d:%@%d hours" = "Time elapsed: %d:%@%d:%@%d hours";
/* ---------------------------------------------------------------------------- */
"%d seconds" = "%d seconds";
"%d:%@%d minutes" = "%d:%@%d minutes";
"%d:%@%d:%@%d hours" = "%d:%@%d:%@%d hours";
"Pause" = "Pause";
"Continue" = "Continue";
"Operation paused" = "Operation paused";
"Cancel" = "Cancel";
"Close" = "Close";
"Operation failed" = "Operation failed";
"Operation failed with error code %d" = "Operation failed with error code %d";
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Choose a name and folder to start the compression" = "Choose a name and folder to start the compression";
"Creation of \"%@\" failed" = "Creation of \"%@\" failed";
"Creating \"%@\"" = "Creating \"%@\"";
"Prepearing extraction..." = "Preparing extraction…";
"Choose a folder to extract this file" = "Choose a folder to extract this file";
"Extraction of \"%@\" failed" = "Extraction of \"%@\" failed";
"Keka - %i on queue" = "Keka - %i on queue";
"Keka can't create this ISO image" = "Keka can't create this ISO image";
"You can only create an ISO image with a single folder. Try to put all your files in a folder and drop it to Keka to create the ISO image." = "You can only create an ISO image with a single folder. Try to put all your files in a folder and drop it to Keka to create the ISO image.";
"Compress \"%@\" in %@ to..." = "Compress \"%@\" in %@ to...";
"Compress in %@ to..." = "Compress in %@ to...";
"Save as:" = "Save as:";
"Compress" = "Compress";
"Extract \"%@\" to..." = "Extract \"%@\" to…";
"Extract as:" = "Extract as:";
"Extract" = "Extract";
" - Remaining: Calculating..." = " - Remaining: Calculating...";
" - Remaining: About one second" = " - Remaining: About one second";
" - Remaining: About %d seconds" = " - Remaining: About %d seconds";
" - Remaining: About 1 minute" = " - Remaining: About 1 minute";
" - Remaining: About %d minutes" = " - Remaining: About %d minutes";
" - Remaining: About 1 hour" = " - Remaining: About 1 hour";
" - Remaining: About %d hours" = " - Remaining: About %d hours";
" - Remaining: About 1 day" = " - Remaining: About 1 day";
" - Remaining: About %d days" = " - Remaining: About %d days";
" - Remaining: About 1 year" = " - Remaining: About 1 year";
" - Remaining: About %d years" = " - Remaining: About %d years";
" - Remaining: Less than one second" = " - Remaining: Less than one second";
"Can't show progress time..." = "Can't show progress time…";
/* ---------------------------------------------------------------------------- */



/* Password window */
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Password for \"%@\"" = "Password for \"%@\"";
/* ---------------------------------------------------------------------------- */



/* Preferences */
// Compression methods
/* ---------------------------------------------------------------------------- */
// Replaced in 1.0
"No compression" = "No compression";
"Fastest, less compression" = "Fastest, less compression";
"Fast, less compression" = "Fast, less compression";
"Normal" = "Normal";
"Slow, more compression" = "Slow, more compression";
"Slowest, more compression" = "Slowest, more compression";

"Method: No compression" = "Method: No compression";
"Method: Fastest, less compression" = "Method: Fastest, less compression";
"Method: Fast, less compression" = "Method: Fast, less compression";
"Method: Normal" = "Method: Normal";
"Method: Slow, more compression" = "Method: Slow, more compression";
"Method: Slowest, more compression" = "Method: Slowest, more compression";
// New in 1.0
"Compression" = "Compression";
"Extraction" = "Extraction";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit.";
"Keka is dying!" = "Keka is dying!";
/* ---------------------------------------------------------------------------- */

// Save location and defaul name combo boxes
"Ask each time" = "Ask each time";
"Next to original file" = "Next to original file";
"Custom folder..." = "Custom folder...";
"Same as original file" = "Same as original file";
"Custom name..." = "Custom name...";
"Compressed file" = "Compressed file";
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Set as default folder" = "Set as default folder";
/* ---------------------------------------------------------------------------- */

// Action to perform - ### VERY IMPORTANT TO BE THE SAME AS IN THE XIB FILE ###
"Perform automatic action" = "Perform automatic action";
"Always compress" = "Always compress";
"Always extract" = "Always extract";

//Split items - ### VERY IMPORTANT TO BE THE SAME AS IN THE XIB FILE ###
"1.4 MB Floppy" = "1.4 MB Floppy disk";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4480 MB DVD" = "4480 MB DVD";



/* Drag and Drop layer */
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Drop here to extract" = "Drop here to extract";
"Drop here to compress" = "Drop here to compress";
/* ---------------------------------------------------------------------------- */



/* Error messages */
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Error code %d\nThe first part \"%@\" can't be found" = "Error code %d\nThe first part \"%@\" can't be found";
"unknown" = "unknown";
"Unknown error" = "Unknown error";
"Error code %d using \"%@\"\n%@" = "Error code %d using \"%@\"\n%@";
"No errors found" = "No errors found";
"Minor error, the operation may be done well" = "Minor error, the operation may be done well";
"Fatal error" = "Fatal error";
"CRC error occurred, maybe the file is corrupt" = "CRC error occurred, maybe the file is corrupt";
"Attempt to modify an archive previously locked" = "Attempt to modify an archive previously locked";
"Maybe you don't have permission to write or your disk is full" = "Maybe you don't have permission to write or your disk is full";
"Can't open the file, maybe you don't have read permission" = "Can't open the file, maybe you don't have read permission";
"Command line error, please contact with the developer" = "Command line error, please contact with the developer";
"Not enough memory. Try to close some programs and repeat the operation" = "Not enough memory. Try to close some programs and repeat the operation";
"Can't create the file, maybe you don't have permission or free space" = "Can't create the file, maybe you don't have permission or free space";
"Canceled manually" = "Canceled manually";
"Bad password, try again" = "Bad password, try again";
"This archive is locked" = "This archive is locked";
"Write error. No permission? No space left?" = "Write error. No permission? No space left?";
"Can't open the file, maybe it's not accessible" = "Can't open the file, maybe it's not accessible";
"No files matching the mask" = "No files matching the mask";
/* ---------------------------------------------------------------------------- */
